API/restful/app/Controllers/Barangkeluar.php

    public function show($id = null)
    {
        $model = new modelbarangkeluar();
        $data = $model->getWhere(['barang_keluar' => $id])->getResult();
---
SELECT *
FROM `keluar`