API/restful/app/Controllers/Barangmasuk.php

    public function show($id = null)
    {
        $model = new modelbarangmasuk();
        $data = $model->getWhere(['barang_masuk' => $id])->getResult();
---
SELECT *
FROM `masuk`
WHERE `barang_masuk` = '2'

   public function update($id = null)
   {
       $model = new modelbarangmasuk();
       $json = $this->request->getJSON();
       if($json){
           $data = [
               'nm_barang' => $json->nm_barang,
               'spesifikasi' => $json->spesifikasi,
               'kategori' => $json->kategori,
               'satuan' => $json->satuan
           ];
       }else{
           $input = $this->request->getRawInput();
           $data = [
               'nm_barang' => $input['nm_barang'],
               'spesifikasi' => $input['spesifikasi'],
               'kategori' => $input['kategori'],
               'satuan' => $input['satuan'],
           ];
       }
       // Insert to Database
       $model->update($id, $data);
---
UPDATE `masuk` SET `nm_barang` = 'keyboard', `spesifikasi` = 'warna pink', `kategori` = 'elektronik', `satuan` = 'pack'
WHERE `masuk`.`barang_masuk` IN ('1')