API/restful/app/Controllers/barang.php

    public function index()
    {
        $data['barang'] = $this->model->paginate(5);
---
SELECT *
FROM `barang`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `barang`

    public function show($id = null)
    {
        $model = new modelbarang();
        $data = $model->getWhere(['id_barang' => $id])->getResult();
---
SELECT *
FROM `barang`
WHERE `id_barang` = '1'

   public function update($id = null)
   {
       $model = new modelbarang();
       $json = $this->request->getJSON();
       if($json){
           $data = [
               'nm_barang' => $json->nm_barang,
               'spesifikasi' => $json->spesifikasi,
               'kategori' => $json->kategori,
               'satuan' => $json->satuan
           ];
       }else{
           $input = $this->request->getRawInput();
           $data = [
               'nm_barang' => $input['nm_barang'],
               'spesifikasi' => $input['spesifikasi'],
               'kategori' => $input['kategori'],
               'satuan' => $input['satuan'],
           ];
       }
       // Insert to Database
       $model->update($id, $data);
---
UPDATE `barang` SET `nm_barang` = 'headphone', `spesifikasi` = 'warna hijau', `kategori` = 'elektronik', `satuan` = 'dus'
WHERE `barang`.`id_barang` IN ('4')