API/restful/app/Controllers/barang.php

UPDATE `barang` SET `nm_barang` = 'headphone', `spesifikasi` = 'warna lilac', `kategori` = 'elektronik', `satuan` = 'pcs'
WHERE `barang`.`id_barang` IN ('1')
---
    public function update($id = null)
    {
        $model = new modelbarang();
        $json = $this->request->getJSON();
        if($json){
            $data = [
                'nm_barang' => $json->nm_barang,
                'spesifikasi' => $json->spesifikasi,
                'kategori' => $json->kategori,
                'satuan' => $json->satuan
            ];
        }else{
            $input = $this->request->getRawInput();
            $data = [
                'nm_barang' => $input['nm_barang'],
                'spesifikasi' => $input['spesifikasi'],
                'kategori' => $input['kategori'],
                'satuan' => $input['satuan']
            ];
        }
        // Insert to Database
        $model->update($id, $data);