API/restful/app/Controllers/Kategori.php

    public function show($id = null)
    {
        $model = new modelkategori();
        $data = $model->getWhere(['id_kategori' => $id])->getResult();
---
SELECT *
FROM `kategori`
WHERE `id_kategori` = '2'

   public function update($id = null)
   {
       $model = new modelkategori();
       $json = $this->request->getJSON();
       if($json){
           $data = [
               'nm_kategori' => $json->nm_kategori
           ];
       }else{
           $input = $this->request->getRawInput();
           $data = [
               'nm_kategori' => $input['nm_kategori'],
           ];
       }
       // Insert to Database
       $model->update($id, $data);
---
UPDATE `kategori` SET `nm_kategori` = 'Elektronik'
WHERE `kategori`.`id_kategori` IN ('2')