API/restful/app/Controllers/Peminjaman.php

    public function show($id = null)
    {
        $model = new modelpeminjaman();
        $data = $model->getWhere(['id_peminjaman' => $id])->getResult();
---
SELECT *
FROM `peminjaman`
WHERE `id_peminjaman` = '4'

    public function create()
    {

        $model = new modelpeminjaman();
        $data = [
            'barang_dipinjam' => $this->request->getVar('barang_dipinjam'),
            'jumlah_barang'  => $this->request->getVar('jumlah_barang'),
            'tanggal_pinjam'  => $this->request->getVar('tanggal_pinjam'),
            'status_peminjaman'  => $this->request->getVar('status_peminjaman'),
        ];
        $model->insert($data);
---
INSERT INTO `peminjaman` (`barang_dipinjam`, `jumlah_barang`, `tanggal_pinjam`, `status_peminjaman`) VALUES ('monitor', '11', '2021-09-19', 'sudah dikembalikan')